---
kind: method
id: M:Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.UV})
source: html/4171eae5-c57e-f33d-36b2-754b8c49a9f7.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV.#ctor Method

Creates object from an array of two-dimensional point coordinates

## Syntax (C#)
```csharp
public FieldDomainPointsByUV(
	IList<UV> points
)
```

## Parameters
- **points** (`System.Collections.Generic.IList < UV >`) - Array of two-dimensional point coordinates representing domain points (usually on surface)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null